---
type: LineSegment
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# LineSegment

`Autodesk.Revit.DB.LineSegment` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EndParameter | 2016 | `public double EndParameter { get ; }` |
| Property | EndPoint | 2016 | `public XYZ EndPoint { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LineProperties | 2016 | `public LineProperties LineProperties { get ; }` |
| Property | StartParameter | 2016 | `public double StartParameter { get ; }` |
| Property | StartPoint | 2016 | `public XYZ StartPoint { get ; }` |